<script setup lang="ts">
import { ref } from 'vue';

const list = ref([
  "2022/06/23 曲詳細モーダルに遷移グラフを追加",
  "2022/05/02 スコアランキングの表示を改善",
  "2022/04/27 スコア画面のレイアウトを調整",
  "2022/04/25 詳細画面にスコアランク, 細分化ランクを追加",
  "2022/03/08 累積プレイ情報画面を追加",
  "2021/07/10 IR機能の追加",
  "2021/06/08 ライバルとのスコア比較機能を追加",
  "2021/06/01 直近で更新した曲リストの表示機能を追加",
  "2021/03/17 ホーム画面のレイアウトを調整",
  "2021/03/05 おすすめ譜面表を追加",
  "2021/02/11 ユーザーリストの追加",
  "2021/01/20 詳細表示の表示を調整 モバイル版に対応",
  "2021/01/13 グラフエリアのクリックで対象曲リストを表示する",
  "2021/01/07 フィルターの状態の保存機能を実装",
  "2021/01/06 IRへのリンクを追加",
  "2021/01/02 名前登録、Twitter共有実装",
  "2021/01/01 ランダムセレクト実装",
  "2020/12/30 ログイン機能実装",
])
</script>

<template>
  <div id="release-note">
    <h2>更新履歴</h2>
    <ul>
      <li v-for="(row, index) in list" :key="index">{{ row }}</li>
    </ul>
  </div>
</template>

<style scoped>
ul {
  list-style: none;
}
</style>